In [3]:
import numpy as np
import pandas as pd

In [ ]:
# operations
df = pd.DataFrame({'col1' : [1,2,3,4] , 'col2' : [444 , 555, 666 ,444] , 'col3' : ['abc' , 'def' , 'ghi' , 'xyz']})
df.head(5)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
df['col2'].unique() # unique values in the thing

array([444, 555, 666])

In [16]:
df['col2'].nunique() # the number of uniques value

3

In [ ]:
(df['col2'].value_counts())

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [24]:
# col1 > 2
# col2 == 444
newdf = df[(df['col1'] > 2)  & (df['col2'] == 444 )] # they should be in parantheses and also the &(and) |(or)
newdf

   col1  col2 col3
3     4   444  xyz

In [ ]:
def times_two(number):
    return number*2

8

In [32]:
df['new'] = df['col2'].apply(times_two)

In [ ]:
# del(df['new']) # or use df.drop
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [39]:
df.columns #idex list of all the columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [40]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [44]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [ ]:
df.sort_values(by=['col2'] , ascending=False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

In [79]:
# set index
# reset index
# df.reset_index(inplace=True)
# del(df['level_0'])
df

   index  col1  col2 col3
0      0     1   444  abc
1      1     2   555  def
2      2     3   666  ghi
3      3     4   444  xyz